app/controllers/conversations_controller.rb

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def close
    @conversation = Conversation.find(params[:id])