app/controllers/friendships_controller.rb

INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["friend_id", 1], ["created_at", "2017-07-23 03:11:27.886332"], ["updated_at", "2017-07-23 03:11:27.886332"]]
---
	def create
	  return false if current_user.friendships.where(friend_id: params[:friend_id]).exists?
	  @friendship = current_user.friendships.build(friend_id: params[:friend_id])
      if @friendship.save

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 1]]
---
	def destroy
	  @friendship = Friendship.find_by(user_id: params[:id])
	  @friendship.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_user
    @user = User.find(params[:user_id]) if params[:user_id].present?