app/controllers/home_controller.rb

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = 1
---
  def index
    session[:conversations] ||= []

    @users = User.all.where.not(id: current_user)
    @conversations = Conversation.includes(:recipient, :messages)
                                 .find(session[:conversations])