app/controllers/mypage_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "place" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "jhk"], ["place", "jk"], ["introduction", "lkj"], ["updated_at", "2017-07-23 08:11:10.583010"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    params.require(:user).permit(:name, :place, :introduction, :images)
    @user.update_attributes(name: params[:user][:name], place: params[:user][:place], introduction: params[:user][:introduction], image: params[:user][:image])