app/controllers/posts_controller.rb

  def index
    @posts = @user.present? ? @user.posts.all : Post.all
---
SELECT "posts".* FROM "posts"

  def create
    @post = @user.present? ? @user.posts.new(post_params) :Post.new(post_params)

    respond_to do |format|
      if @post.save
        format.html { redirect_to (@user.present? ? [@post.user, @post] : @post), notice: 'Post was successfully created.' }
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?)  [["title", "fd"], ["content", "dfs"], ["created_at", "2017-07-20 08:08:41.095004"], ["updated_at", "2017-07-20 08:08:41.095004"], ["image", "1_-_Screen_1_2.png"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_user
      @user = User.find(params[:user_id]) if params[:user_id].present?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_post
      if @user.present?
        @post = @user.posts.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]