app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles"
SELECT "users".* FROM "users"
---
  def index
    @profiles = Profile.all
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def show
    @user = User.find(params[:id])
    @users = current_user.friends
    @allUsers = User.all